Билет01/DataProcessors/ЗаполнениеГрафика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ЗаполнениеГрафика</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>График</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Графики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Билет01/InformationRegisters/ГрафикиРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ГрафикиРаботы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>График</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Графики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Билет01/DataProcessors/ЗаполнениеГрафика/Forms/Форма/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Процедура ЗаполнитьГрафикНаСервере(ДатаН, ДатаК, График)
    ДатаГрафика	= ДатаН;  
	ДниНедели	= 7;
	Пока ДатаГрафика<=ДатаК Цикл
		НовЗапись				= РегистрыСведений.ГрафикиРаботы.СоздатьМенеджерЗаписи();
		НовЗапись.Дата			= ДатаГрафика;
		НовЗапись.График		= График;
		Если ДниНедели < 6 Тогда
			НовЗапись.Значение	= 1;	// нам нужны дни	
		Иначе
			НовЗапись.Значение	= 0;	
		КонецЕсли;                                         
		НовЗапись.Записать();	
		
		ДниНедели				= ДниНедели + 1;
		Если ДниНедели>7 Тогда
			ДниНедели			= 1;			
		КонецЕсли; 
 		ДатаГрафика				= ДатаГрафика+(60*60*24);
	КонецЦикла;
	

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГрафик(Команда)
	ЗаполнитьГрафикНаСервере(Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания, Объект.График);     
	Сообщение		= Новый СообщениеПользователю;
	Сообщение.Текст	= "График заполнен!";
	Сообщение.Сообщить();
КонецПроцедуры
